---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Transform1D
source: html/a9b5b555-6085-c3d3-9413-61b1bcf17e70.htm
---
# Transform1D Members

Constructs the transformation by specifying the scale only.